<<<<<<< HEAD
{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_9", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_36"}, "name": "input_36", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_35", "trainable": false, "batch_input_shape": [null, 500], "dtype": "float32", "input_dim": 98818, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 500}, "name": "embedding_35", "inbound_nodes": [[["input_36", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_49", "inbound_nodes": [[["embedding_35", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_37", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_37", "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_38", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_38", "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_17", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_17", "inbound_nodes": [[["conv1d_37", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_18", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_18", "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_35", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 12}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 13}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 14}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_35", "inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"name": "gru_28", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 17}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 18}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 19}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "gru_28", "inbound_nodes": [[["max_pooling1d_18", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_8", "inbound_nodes": [[["lstm_35", 0, 0, {}], ["gru_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}], "input_layers": [["input_36", 0, 0]], "output_layers": [["dense_9", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "conv1d_37_1/kernel", "shape": [5, 50, 64], "dtype": "float32"}, {"name": "conv1d_37_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_38_1/kernel", "shape": [5, 50, 64], "dtype": "float32"}, {"name": "conv1d_38_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_9_1/kernel", "shape": [256, 2], "dtype": "float32"}, {"name": "dense_9_1/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding_35_1/embeddings", "shape": [98818, 50], "dtype": "float32"}, {"name": "gru_28_1/gru_cell_68/kernel", "shape": [64, 384], "dtype": "float32"}, {"name": "gru_28_1/gru_cell_68/recurrent_kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "gru_28_1/gru_cell_68/bias", "shape": [2, 384], "dtype": "float32"}, {"name": "lstm_35_1/lstm_cell_76/kernel", "shape": [64, 512], "dtype": "float32"}, {"name": "lstm_35_1/lstm_cell_76/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_35_1/lstm_cell_76/bias", "shape": [512], "dtype": "float32"}]}]}
=======
{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_21"}, "name": "input_21", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_20", "trainable": false, "batch_input_shape": [null, 500], "dtype": "float32", "input_dim": 98818, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 500}, "name": "embedding_20", "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_34", "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_20", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 4}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 5}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_16", "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_18", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 10}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 11}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 12}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "bidirectional_17", "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_23", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_23", "inbound_nodes": [[["bidirectional_16", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_24", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_24", "inbound_nodes": [[["bidirectional_17", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_10", "inbound_nodes": [[["conv1d_23", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_11", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_11", "inbound_nodes": [[["conv1d_24", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_10", "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_11", "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_5", "inbound_nodes": [[["flatten_10", 0, 0, {}], ["flatten_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}], "input_layers": [["input_21", 0, 0]], "output_layers": [["dense_5", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "bidirectional_16_1/forward_lstm_20/lstm_cell_49/kernel", "shape": [50, 256], "dtype": "float32"}, {"name": "bidirectional_16_1/forward_lstm_20/lstm_cell_49/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_16_1/forward_lstm_20/lstm_cell_49/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_16_1/backward_lstm_20/lstm_cell_50/kernel", "shape": [50, 256], "dtype": "float32"}, {"name": "bidirectional_16_1/backward_lstm_20/lstm_cell_50/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_16_1/backward_lstm_20/lstm_cell_50/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_17_1/forward_gru_18/gru_cell_47/kernel", "shape": [50, 192], "dtype": "float32"}, {"name": "bidirectional_17_1/forward_gru_18/gru_cell_47/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "bidirectional_17_1/forward_gru_18/gru_cell_47/bias", "shape": [2, 192], "dtype": "float32"}, {"name": "bidirectional_17_1/backward_gru_18/gru_cell_48/kernel", "shape": [50, 192], "dtype": "float32"}, {"name": "bidirectional_17_1/backward_gru_18/gru_cell_48/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "bidirectional_17_1/backward_gru_18/gru_cell_48/bias", "shape": [2, 192], "dtype": "float32"}, {"name": "conv1d_23_1/kernel", "shape": [3, 128, 32], "dtype": "float32"}, {"name": "conv1d_23_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_24_1/kernel", "shape": [5, 128, 32], "dtype": "float32"}, {"name": "conv1d_24_1/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_5_1/kernel", "shape": [15904, 2], "dtype": "float32"}, {"name": "dense_5_1/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding_20_1/embeddings", "shape": [98818, 50], "dtype": "float32"}]}]}
>>>>>>> b8f32921abb3526e042586ef1b24f1d1dcb2b3d0
